OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/LPC824/drivers/fsl_spi.h
/*
 * The Clear BSD License
 * Copyright (c) 2017, NXP Semiconductors, Inc.
 * All rights reserved.
 *
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _FSL_SPI_H_
#define _FSL_SPI_H_

#include "fsl_common.h"

/*!
 * @addtogroup spi_driver
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief SPI driver version 2.0.0. */
#define FSL_SPI_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

#ifndef SPI_DUMMYDATA
/*! @brief SPI dummy transfer data, the data is sent while txBuff is NULL. */
#define SPI_DUMMYDATA (0xFFFFU)
#endif

/* @brief Dummy data for each instance. This data is used when user's tx buffer is NULL*/
extern volatile uint16_t s_dummyData[];

/*! @brief SPI transfer option.*/
enum _spi_xfer_option
{
    kSPI_EndOfFrame = (SPI_TXDATCTL_EOF_MASK),         /*!< Data is treated as the end of a frame. */
    kSPI_EndOfTransfer = (SPI_TXDATCTL_EOT_MASK),      /*!< Data is treated as the end of a transfer. */
    kSPI_ReceiveIgnore = (SPI_TXDATCTL_RXIGNORE_MASK), /*!< Ignore the receive data. */
};

/*! @brief SPI data shifter direction options.*/
typedef enum _spi_shift_direction
{
    kSPI_MsbFirst = 0U, /*!< Data transfers start with most significant bit. */
    kSPI_LsbFirst = 1U, /*!< Data transfers start with least significant bit. */
} spi_shift_direction_t;

/*! @brief SPI clock polarity configuration.*/
typedef enum _spi_clock_polarity
{
    kSPI_ClockPolarityActiveHigh = 0x0U, /*!< Active-high SPI clock (idles low). */
    kSPI_ClockPolarityActiveLow = 0x1U,  /*!< Active-low SPI clock (idles high). */
} spi_clock_polarity_t;

/*! @brief SPI clock phase configuration.*/
typedef enum _spi_clock_phase
{
    kSPI_ClockPhaseFirstEdge = 0x0U,  /*!< First edge on SCK occurs at the middle of the first
                                          *   cycle of a data transfer. */
    kSPI_ClockPhaseSecondEdge = 0x1U, /*!< First edge on SCK occurs at the start of the
                                   *   first cycle of a data transfer. */
} spi_clock_phase_t;

/*! @brief Slave select */
typedef enum _spi_ssel
{
    kSPI_Ssel0Assert = ~SPI_TXDATCTL_TXSSEL0_N_MASK, /*!< Slave select 0 */
#if defined(SPI_TXDATCTL_TXSSEL1_N_MASK)
    kSPI_Ssel1Assert = ~SPI_TXDATCTL_TXSSEL1_N_MASK, /*!< Slave select 1 */
#endif
#if defined(SPI_TXDATCTL_TXSSEL2_N_MASK)
    kSPI_Ssel2Assert = ~SPI_TXDATCTL_TXSSEL2_N_MASK, /*!< Slave select 2 */
#endif
#if defined(SPI_TXDATCTL_TXSSEL3_N_MASK)
    kSPI_Ssel3Assert = ~SPI_TXDATCTL_TXSSEL3_N_MASK, /*!< Slave select 3 */
#endif
    kSPI_SselDeAssertAll = (SPI_TXDATCTL_TXSSEL0_N_MASK
#if defined(FSL_FEATURE_SPI_HAS_SSEL1) & FSL_FEATURE_SPI_HAS_SSEL1
                            |
                            SPI_TXDATCTL_TXSSEL1_N_MASK
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL2) & FSL_FEATURE_SPI_HAS_SSEL2
                            |
                            SPI_TXDATCTL_TXSSEL2_N_MASK
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL3) & FSL_FEATURE_SPI_HAS_SSEL3
                            |
                            SPI_TXDATCTL_TXSSEL3_N_MASK
#endif
                            ),
} spi_ssel_t;

/*! @brief ssel polarity */
typedef enum _spi_spol
{
#if defined(FSL_FEATURE_SPI_HAS_SSEL0) & FSL_FEATURE_SPI_HAS_SSEL0
    kSPI_Spol0ActiveHigh = SPI_CFG_SPOL0_MASK,
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL1) & FSL_FEATURE_SPI_HAS_SSEL1
    kSPI_Spol1ActiveHigh = SPI_CFG_SPOL1_MASK,
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL2) & FSL_FEATURE_SPI_HAS_SSEL2
    kSPI_Spol2ActiveHigh = SPI_CFG_SPOL2_MASK,
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL3) & FSL_FEATURE_SPI_HAS_SSEL3
    kSPI_Spol3ActiveHigh = SPI_CFG_SPOL3_MASK,
#endif
    kSPI_SpolActiveAllHigh = (SPI_CFG_SPOL0_MASK
#if defined(FSL_FEATURE_SPI_HAS_SSEL1) & FSL_FEATURE_SPI_HAS_SSEL1
                              |
                              SPI_CFG_SPOL1_MASK
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL2) & FSL_FEATURE_SPI_HAS_SSEL2
                              |
                              SPI_CFG_SPOL2_MASK
#endif
#if defined(FSL_FEATURE_SPI_HAS_SSEL3) & FSL_FEATURE_SPI_HAS_SSEL3
                              |
                              SPI_CFG_SPOL3_MASK
#endif
                              ),
    kSPI_SpolActiveAllLow = ~kSPI_SpolActiveAllHigh,
} spi_spol_t;

